# -*- coding: utf-8 -*-
"""
Created on Thu Oct 15 10:53:23 2020

@author: huochao
"""




bad_name = {'口大','绑定百度钱包','出歌','人民大会堂','湿地','化石','周予','谢广辉','吴贤庆','谢添','华语乐坛','铀','罗伯特·布雷森','加里·吉盖克斯','1992年', '2002', '2010年8月', '2013', '919年', 'SBS', '一水', '一点一滴', '丁颖', '上杭县', '上海文学', '下游', '不见经传', '中国传媒大学', '中国铁道出版社', '中国青年艺术剧院', '为主', '于山', '于波', '五音不全', '优酷网', '余刚', '其中', '冲破', '北京电视台', '华简', '南方', '南风吹', '博士',  '古文字学', '向内', '品牌', '唐朝', '喀山', '四川师范大学', '国泉', '埃塞俄比亚', '夜后', '大小说', '大岛渚', '大成', '大源', '大社会', '太平村', '失之千里', '女王公园', '娱乐', '子思', '存在过', '学院', '宇宙空间', '安知晓', '官员', '实验室', '幻魔法', '应是', '张钰', '情况', '执行主席', '技术工', '捷克国家足球队', '摩托罗拉手机', '敏学', '整形专家', '文学理论', '断裂带', '新华都', '是爱', '暖夏', '机械设计', '杂化轨道理论', '柳市', '欧洲冠军联赛', '欧盟委员会主席', '欧阳修', '武冈', '武夷龙井山', '民科', '江青', '池昌旭', '波塔宁', '火花', '电视剧', '皮朝晖', '研究', '研究生', '神经系统', '经济管理专业',  '网络写手', '美国', '美术学', '胎动不安', '膝关节', '艺术品鉴', '花鸟画', '葡萄牙', '蓝拳圣使', '行政管理', '被迫辞职', '观赏植物', '许州', '豆科', '赵丹青', '跋方云台文藁二十韵', '运动损伤', '迪奥夫', '郑辛遥', '阿森纳足球俱乐部', '隶属', '高等教育','乱七八糟的爱', '高级', '黑龙江'}
bad_tag = {'鲸','人事',"网站建设","医药学","领导者","求职","广播电台","棋士","中小学","古典文学","场馆","野生动物","副中心","鉴赏家","理论","基督教","自传体小说","苹果","喜剧片","体育老师","佛学","互联网","艺员","角色扮演游戏","钢琴家","图片","瓷器","手术","组合","伊斯兰教","基金会","价格","仙侠小说","冒险游戏","日本漫画","人群","中医药","绘画","元帅","网络游戏","风云人物","核能","人大代表","菜肴","东南亚","税收","老鼠","耽美小说","创新人才","法律法规","赛马","英烈","街舞","女艺人","残疾人","论坛","时间","复印","社会学家","事业单位","外国文学","动漫作品","男性","星云","游泳","方剂","格斗游戏","社会活动家","水木剧","恐怖电影","科学","技击","鱼类","报纸","草原","文学","公共交通","信息","儿童文学","水稻","武术家","休闲小游戏","哲学家","香港电影","图画书","实业家","候鸟","裁判","内地演员","女明星","女作家","分析","物理","南宁","观赏植物","发明家","英国演员","香港演员","志愿者","空调","树木","陆军","旅游度假","青年歌手","战争电影","古籍","相声","君主","迪士尼","历史学家","杂文","试验","逻辑学","宗室","运动","博物馆","病证","电影人","相关法律","通讯","装修","英文","地区","研究所","爱情片","评论","政法","少儿","科幻片","航空公司","行政区域","礼仪","加州","雕塑家","中央电视台","糖尿病","孔子","孩子","平面设计师","编曲","宗教文化","音乐专辑","国歌","传播学","女子","益智游戏","收藏","漫画作品","散文","气体","植物药","纳米","电子商务","供销","吉他手","军校","旅行","经济管理学院","中草药","投资银行","亚运","天主教","地球物理","灌区","高级中学","移民","模拟游戏","翻译","动作明星","文字","名医","甜点","团队","台湾艺人","博士。","古装剧","舞蹈家","慈善家","学术研究","产业经济","海运","科幻小说","期刊","理财","保健品","历史名人","物理化学","围棋","日本女演员","饮食","车站","射击游戏","科幻电影","相机","水力发电","快板","艺术","领导人","电学","海滨","国学","计算机学","支线客机","专业","政法学院","功臣","都市小说","岩石学","食物","木本植物","油画家","穴位","饮料","词人","韩国模特","民警","技术","民族音乐","博客","法国作家","摄影师","街道","设计","法师","信息技术","矿物","检察院","动画电影","纪录片","穿越小说","推理小说","铁路","文化传承","电视频道","话剧","职业学院","思想家","生物技术","出差","光学","教程","水域","手游","安全","环保","评书","文学艺术","策略游戏","语文","招生","航空航天","道路","考古学","中国地理","化学工程","动作游戏","文化节","古希腊","生物化学","郡","历史名城","护肤品","道教","情绪","工会主席","动画片","音乐创作人","组织机构","惊悚电影","菜品","歌星","地理位置","经济法","美学","职位","微生物学","宇宙","配角","书画","地点","微电影","狙击手","地域","心理学家","原创","法院","陶瓷","民营企业","民族英雄","信息科学学院","情趣用品","人物传记","宣传","名家","文艺学","天文学家","音乐节目","组诗","生物学家","台湾演员","场景","海员","法人代表","网络剧","中医","教育","诗集","散文家","管理学","西部","益智小游戏","图书馆","古装电视剧","周末剧","智能手机","内地男演员","文化","配音员","统一","动作片","湖泊","报社","高等教育","国际法","水文","文章","法律","教练机","国家级自然保护区","硬笔书法","数学","古生物学","村落","植物学","化学","农产品","高新区","偶像剧","公司法","科教","影星","动力机械","FPS游戏","艺术团","泰国演员","理学","游禽","舆情","游戏作品","官吏","常务副院长","神话传说","童话","军事家","自治县","京剧演员","同人小说","古诗","哈尔滨","研究","林业","男篮","公文","爱情剧","政府机构","电视节目","真菌","社会","数据库","美国演员","公司","企业管理","节肢动物","摄像机","社会科学","网页设计","奢侈品牌","访谈节目","火炮","现代文学","电影公司","统计学","专利","细胞生物学","美术","四川人","交通","茶类","涉禽","管理","风景区","文学书籍","标志","电力","大学","DJ","知识","宽带","韩国女演员","操作系统","神学","肿瘤","生态学","创新","中国近现代史","鸣禽","高速公路","学运","小吃","宰相","人类学","研究院","历史","B2C","印刷","创意","经纪公司","科研","法学","品牌","自然","史诗","博导","音乐组合","地理","职业学校","机械工程","居委会","电视连续剧","建筑学","农业","生活","投资","楼盘","民盟盟员","地球科学","酒店住宿","评论家","乡镇","猛禽","饭店","语言学家","政协","纪念馆","水利工程","手机游戏","医院","法学家","火车站","新闻频道","悬疑剧","主播","军旅电视剧","杰尼斯","流行音乐","曲艺家","商品","化工","动作电影","人工智能","科研机构","影视剧演员","拍摄","北美","色彩","出版物","细菌","麻省理工","政治学家","游戏开发","民法","土木工程","学校","方法","散曲","唱片","行政村","神话人物","工笔画","物流","大陆演员","动物保护","犯罪电影","粮食局","军人","新媒体","时尚手机","射击类游戏","短片","海湾","旅游","贵族","小区","农学","韩国演员","地方","分类","舞蹈演员","建筑工程","球队","数码产品","个人","有机化学","教育心理学","寺院","战争片","艺术馆","妇产科","民航","社保","新闻学","电器","恐怖片","保险","药理学","椋鸟科","综艺节目","贺岁片","公务员","民乐","建材","军事小说","日本演员","教育学家","桥梁"}
bad_comp = ['厂','出版社','公司','家','年','月','俱乐部','日','学','集团']


text = open('data/text.txt',encoding='utf-8')
names = open('data/long_name.txt',encoding='utf-8')
tags = open('data/long_tag.txt',encoding='utf-8')
out = open('data/out.txt','w',encoding='utf-8')


name_set = {i.strip() for i in names}
tag_set = {i.strip() for i in tags}
text_set = {i.strip() for i in text}

text.close()
tags.close()
names.close()

line_ct = 0

for line in text_set:
    line_ct += 1
    if line_ct %1000 == 0:
        print(line_ct)
    line = line.split('###')[0].split('%%%')[0]
    for n in name_set:
        if n in bad_name:
            continue
        
        for bad_word in bad_comp:
            if bad_word in n:
                continue

        if n in line:
            for t in tag_set:

                if t in bad_tag:
                    continue
                if t in line:
                    head_start = line.find(n)
                    head_end = head_start + len(n) -1
                    tail_start = line.find(t)
                    tail_end = tail_start + len(t) - 1
                    
                    if head_start>=tail_start and head_start <=tail_end:
                        continue
                    if head_end>=tail_start and head_end <=tail_end:
                        continue
                    if tail_start>=head_start and tail_start<=head_end:
                        continue
                    if tail_end>=head_start and tail_end<=head_end:
                        continue
                    out.write(line+' '+n+' '+t+'\n')
out.close()